tap "blacknon/hwatch"
tap "bufbuild/buf"
tap "d12frosted/emacs-plus"
tap "equalsraf/neovim-qt"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "jesseduffield/lazydocker"
tap "kernel/kernel", "git@source.golabs.io:kernel/user-experience/cli/homebrew-kernel.git"
tap "supabase/tap"
brew "little-cms2"
brew "jpeg-xl"
brew "aom"
brew "asciinema"
brew "autoconf"
brew "automake"
brew "coreutils"
brew "asdf"
brew "autoconf@2.69"
brew "jansson"
brew "azure-cli"
brew "node"
brew "basedpyright"
brew "bash"
brew "bash-completion"
brew "bat"
brew "beancount"
brew "binutils"
brew "black"
brew "boost"
brew "buf"
brew "caddy"
brew "glib"
brew "carthage"
brew "catch2"
brew "gcc"
brew "clang-format"
brew "cmake"
brew "cocoapods"
brew "dateutils"
brew "ddcctl"
brew "deno"
brew "direnv"
brew "docker"
brew "dtach"
brew "harfbuzz"
brew "openjdk"
brew "emscripten"
brew "erlang"
brew "unbound"
brew "gnutls"
brew "sdl2"
brew "tesseract"
brew "ffmpeg"
brew "ffmpeg@6"
brew "findutils"
brew "fish"
brew "fzf"
brew "gawk"
brew "gdk-pixbuf"
brew "gh"
brew "gifsicle"
brew "git-lfs"
brew "gnu-indent"
brew "gnu-sed"
brew "gnu-tar"
brew "qt"
brew "gnuplot"
brew "golang-migrate"
brew "google-benchmark"
brew "gradle"
brew "grep"
brew "gsettings-desktop-schemas"
brew "pkgconf"
brew "guile"
brew "helm"
brew "htop"
brew "httpie"
brew "hugo"
brew "libheif"
brew "libraw"
brew "imagemagick"
brew "iproute2mac"
brew "ipython"
brew "iredis"
brew "jq"
brew "k9s"
brew "librdkafka"
brew "kcat"
brew "kubectx"
brew "libpcap"
brew "libpq"
brew "librsvg"
brew "libxml2"
brew "litecli"
brew "llvm"
brew "lsd"
brew "lua-language-server"
brew "luv"
brew "micro"
brew "micromamba"
brew "minikube"
brew "minimal-racket"
brew "protobuf"
brew "mosh"
brew "most"
brew "mpc"
brew "multitail"
brew "musikcube"
brew "nanomsg"
brew "ncmpcpp"
brew "neofetch"
brew "neovim"
brew "neovide"
brew "netpbm"
brew "nghttp2"
brew "ninja"
brew "nlohmann-json"
brew "nng"
brew "pyqt"
brew "vtk"
brew "opencv"
brew "openjdk@17"
brew "p7zip"
brew "pgcli"
brew "prettier"
brew "protoc-gen-go"
brew "protoc-gen-go-grpc"
brew "pyright"
brew "python@3.10"
brew "python@3.11"
brew "qemu"
brew "qt@5"
brew "ranger"
brew "redis"
brew "ripgrep"
brew "rust-analyzer"
brew "scrcpy"
brew "serve"
brew "stern"
brew "swi-prolog"
brew "tcl-tk"
brew "telnet"
brew "tmux"
brew "tmuxinator"
brew "tree"
brew "ttfautohint"
brew "ungit"
brew "viddy"
brew "wget"
brew "youtube-dl"
brew "zig"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-history-substring-search"
brew "zsh-syntax-highlighting"
brew "equalsraf/neovim-qt/neovim-qt"
brew "jesseduffield/lazydocker/lazydocker"
brew "kernel/kernel/kernel_rc"
cask "alt-tab"
cask "android-studio"
cask "audacity"
cask "browserosaurus"
cask "copilot-for-xcode"
cask "dbeaver-community"
cask "firefox@nightly"
cask "flutter"
cask "font-consolas-for-powerline"
cask "font-cousine-nerd-font"
cask "font-go-mono-nerd-font"
cask "font-gohufont-nerd-font"
cask "font-hack-nerd-font"
cask "font-hasklug-nerd-font"
cask "font-inconsolata-nerd-font"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "font-lekton-nerd-font"
cask "font-menlo-for-powerline"
cask "font-meslo-for-powerline"
cask "font-sometype-mono"
cask "font-ubuntu-mono-nerd-font"
cask "gimp"
cask "google-cloud-sdk"
cask "iterm2"
cask "keepingyouawake"
cask "maccy"
cask "marta"
cask "miniforge"
cask "ngrok"
cask "notion"
cask "qbittorrent"
cask "redisinsight"
cask "visual-studio-code"
cask "wezterm"
cask "wireshark"
vscode "1yib.rust-bundle"
vscode "aalaap.theme-toothpaste"
vscode "aaron-bond.better-comments"
vscode "aaronthomas.vscode-snazzy-operator"
vscode "abrielleing.midsummer-night"
vscode "acheronfail.arithmetic"
vscode "adpyke.vscode-sql-formatter"
vscode "ahmadalli.vscode-nginx-conf"
vscode "aksamyt.solarized-zero"
vscode "alexisvt.flutter-snippets"
vscode "alireza94.theme-gotham"
vscode "anonknowsit.call-of-the-desert"
vscode "apollographql.apollo-midnight-color-theme"
vscode "apollographql.vscode-apollo"
vscode "arcticicestudio.nord-visual-studio-code"
vscode "arzg.apprentice"
vscode "arzg.rustdoc-theme"
vscode "arzg.slate"
vscode "avetis.gogh-theme"
vscode "awesomektvn.scratchpad"
vscode "balintgyarmathy.nord-deep-visible-comments"
vscode "be5invis.theme-railgun"
vscode "be5invis.vscode-custom-css"
vscode "bierner.markdown-mermaid"
vscode "bourhaouta.tailwindshades"
vscode "bradlc.vscode-tailwindcss"
vscode "bradymholt.pgformatter"
vscode "carakan.new-railscasts"
vscode "cardinal90.multi-cursor-case-preserve"
vscode "catppuccin.catppuccin-vsc"
vscode "catppuccin.catppuccin-vsc-icons"
vscode "chad.zenburn-proper"
vscode "chaseadamsio.vscode-theme-neon-night"
vscode "cocopon.iceberg-theme"
vscode "coolbear.systemd-unit-file"
vscode "cxctxs.mono-dark"
vscode "dansarich.lovelace-theme"
vscode "dart-code.dart-code"
vscode "dart-code.flutter"
vscode "davidaburns.handmade-dark"
vscode "davidanson.vscode-markdownlint"
vscode "daylerees.rainglow"
vscode "dbaeumer.vscode-eslint"
vscode "diamondmind.solarized-neue"
vscode "dimitarnonov.jellybeans-theme"
vscode "dmarticus.hackage-theme"
vscode "donjayamanne.githistory"
vscode "donjayamanne.python-environment-manager"
vscode "dracula-theme.theme-dracula"
vscode "drzix.hc-zenburn-vscode"
vscode "dustypomerleau.rust-syntax"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "emilijanmb.sublime-text-4-theme"
vscode "emmakrause.chalk"
vscode "enkia.tokyo-night"
vscode "eriklynd.json-tools"
vscode "esbenp.prettier-vscode"
vscode "evan-buss.font-switcher"
vscode "evan-siegel.navy-and-ivory"
vscode "fabiospampinato.vscode-diff"
vscode "fem12n.night"
vscode "fgcintra.longsight-light-theme"
vscode "fill-labs.dependi"
vscode "foolusion.acme-theme"
vscode "fwcd.kotlin"
vscode "gaearon.subliminal"
vscode "gerane.theme-textmate"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "golang.go"
vscode "goldyflakes.dork"
vscode "gracefulpotato.pastel-night"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-syntax"
vscode "guidotapia2.unicode-math-vscode"
vscode "harveywang.monokai-lite"
vscode "hashicorp.terraform"
vscode "heavenaldrico.aldrico-s-gruvbox"
vscode "hkmix.solarized-dark-vim"
vscode "hoovercj.vscode-settings-cycler"
vscode "humao.rest-client"
vscode "huytd.github-light-monochrome"
vscode "huytd.nord-light"
vscode "huytd.solarized-brighter-light"
vscode "ibm.output-colorizer"
vscode "jackevoniuk.real-retro"
vscode "jackkenney.solarized-chandrian"
vscode "janisdd.vscode-edit-csv"
vscode "jaredkent.laserwave"
vscode "jean.desaturated"
vscode "jeppeskovsen.obsidian"
vscode "jock.svg"
vscode "jonasalex.ocean-cyan-color-theme"
vscode "josetr.cmake-language-support-vscode"
vscode "jrtools.mariana"
vscode "jsynowiec.vscode-insertdatestring"
vscode "justusadam.language-haskell"
vscode "jzarzoso.break-from-comma"
vscode "karyfoundation.racket"
vscode "kenziebottoms.chalkboard"
vscode "konstantin.wrapselection"
vscode "kumar-harsh.graphql-for-vscode"
vscode "lighthaus-theme.lighthaus-vscode"
vscode "liviuschera.noctis"
vscode "m0hammedimran.lighthaus-inspired-theme"
vscode "mangeshrex.everblush"
vscode "marioqueiros.camelcase"
vscode "marlosirapuan.nord-deep"
vscode "mathiasfrohlich.kotlin"
vscode "mayank-shekhar.dracula-dark-vibrant"
vscode "mde.select-highlight-minimap"
vscode "mechatroner.rainbow-csv"
vscode "meezilla.json"
vscode "metaphore.kanagawa-vscode-color-theme"
vscode "mikegleasonjr.theme-go"
vscode "mikestead.dotenv"
vscode "mrmartian.everforest-moist"
vscode "mrorz.language-gettext"
vscode "mrwilford.theme-gruvball"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.live-server"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.sublime-keybindings"
vscode "ms-vscode.vscode-typescript-next"
vscode "mtxr.sqltools"
vscode "mtxr.sqltools-driver-pg"
vscode "nash.awesome-flutter-snippets"
vscode "neptunedesign.vs-sequential-number"
vscode "nevyk.draculight"
vscode "nord.nord"
vscode "oscarnewman.carbon-theme-dark"
vscode "pancho111203.vscode-ipython"
vscode "peterj.proto"
vscode "pmndrs.pmndrs"
vscode "polymeilex.wgsl"
vscode "pomdtr.excalidraw-editor"
vscode "prisma.prisma"
vscode "qufiwefefwoyn.kanagawa"
vscode "ransh.ransh"
vscode "raynigon.nginx-formatter"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "robert-brunhage.flutter-riverpod-snippets"
vscode "rust-lang.rust-analyzer"
vscode "ryanolsonx.mariana-by-ryan"
vscode "ryanolsonx.mnml-theme"
vscode "ryanolsonx.sandcastle-theme"
vscode "ryanolsonx.solarized"
vscode "ryanolsonx.zenburn"
vscode "sainnhe.everforest"
vscode "sainnhe.sonokai"
vscode "samrc.night-pink"
vscode "sdras.night-owl"
vscode "shalldie.background"
vscode "shelby-landen.warm-night"
vscode "siwatts.jellybeans-vim-theme"
vscode "sonianurag.paper-theme"
vscode "stkb.rewrap"
vscode "superzadeh.theme-solarized-obsidian"
vscode "tamasfe.even-better-toml"
vscode "tomoki1207.selectline-statusbar"
vscode "twxs.cmake"
vscode "u2018166490288.j-blow"
vscode "uttntt.dimloglines"
vscode "vadimcn.vscode-lldb"
vscode "visualdecree.honeywell-theme"
vscode "vmcgon.flutter-theme"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "waderyan.gitblame"
vscode "william-voyek.vscode-nginx"
vscode "willt.nord-nights"
vscode "wmaurer.change-case"
vscode "xaver.clang-format"
vscode "yescode.my-minimal-theme"
vscode "yile-ou.paddy-color-theme"
vscode "yzhang.markdown-all-in-one"
vscode "zainchen.json"
vscode "zambam83.nord-theme"
vscode "zamerick.vscode-caddyfile-syntax"
vscode "ziglang.vscode-zig"
vscode "zignd.html-css-class-completion"
vscode "zivit.one-dark"
vscode "zxh404.vscode-proto3"
