tap "bufbuild/buf"
tap "d12frosted/emacs-plus"
tap "homebrew/bundle"
tap "homebrew/services"
brew "little-cms2"
brew "jpeg-xl"
brew "automake"
brew "azure-cli"
brew "bash"
brew "bash-completion"
brew "beancount"
brew "binutils"
brew "boost"
brew "buf"
brew "caddy"
brew "gcc"
brew "clang-format"
brew "cmake"
brew "coreutils"
brew "direnv"
brew "dtach"
brew "tesseract"
brew "fzf"
brew "gnu-sed"
brew "go"
brew "golangci-lint"
brew "google-benchmark"
brew "openjdk"
brew "gradle"
brew "htop"
brew "httpie"
brew "hugo"
brew "libtool"
brew "imagemagick"
brew "ipython"
brew "jq"
brew "libpq"
brew "librsvg"
brew "micromamba"
brew "protobuf"
brew "mosh"
brew "neofetch"
brew "neovim"
brew "qt@5"
brew "neovim-qt"
brew "ninja"
brew "node"
brew "opencv"
brew "p7zip"
brew "pkg-config"
brew "podman"
brew "ranger"
brew "redis", restart_service: true
brew "tmux"
brew "tree"
brew "ttfautohint"
brew "zoxide"
cask "alt-tab"
cask "browserosaurus"
cask "dbeaver-community"
cask "gimp"
cask "google-cloud-sdk"
cask "maccy"
cask "ngrok"
cask "notion"
cask "wireshark"
vscode "aaron-bond.better-comments"
vscode "acheronfail.arithmetic"
vscode "adpyke.vscode-sql-formatter"
vscode "Aksamyt.solarized-zero"
vscode "apollographql.apollo-midnight-color-theme"
vscode "apollographql.vscode-apollo"
vscode "arcticicestudio.nord-visual-studio-code"
vscode "awesomektvn.scratchpad"
vscode "be5invis.theme-railgun"
vscode "be5invis.vscode-custom-css"
vscode "bierner.markdown-mermaid"
vscode "bradlc.vscode-tailwindcss"
vscode "bungcip.better-toml"
vscode "carakan.new-railscasts"
vscode "Catppuccin.catppuccin-vsc"
vscode "Catppuccin.catppuccin-vsc-icons"
vscode "Chad.zenburn-proper"
vscode "cocopon.iceberg-theme"
vscode "CorreiaGitHubGruvbox.correia-github-gruvbox"
vscode "cxctxs.mono-dark"
vscode "Dart-Code.dart-code"
vscode "Dart-Code.flutter"
vscode "daylerees.rainglow"
vscode "dbaeumer.vscode-eslint"
vscode "diamondmind.solarized-neue"
vscode "dmarticus.hackage-theme"
vscode "donjayamanne.githistory"
vscode "donjayamanne.python-environment-manager"
vscode "eamodio.gitlens"
vscode "EditorConfig.EditorConfig"
vscode "EmilijanMB.sublime-text-4-theme"
vscode "esbenp.prettier-vscode"
vscode "evan-buss.font-switcher"
vscode "fabiospampinato.vscode-diff"
vscode "fwcd.kotlin"
vscode "golang.go"
vscode "GraphQL.vscode-graphql"
vscode "GraphQL.vscode-graphql-syntax"
vscode "GuidoTapia2.unicode-math-vscode"
vscode "hashicorp.terraform"
vscode "hkmix.solarized-dark-vim"
vscode "hoovercj.vscode-settings-cycler"
vscode "humao.rest-client"
vscode "indigo.bird"
vscode "janisdd.vscode-edit-csv"
vscode "jrtools.mariana"
vscode "jsynowiec.vscode-insertdatestring"
vscode "jzarzoso.break-from-comma"
vscode "konstantin.wrapSelection"
vscode "kumar-harsh.graphql-for-vscode"
vscode "mangeshrex.Everblush"
vscode "marlosirapuan.nord-deep"
vscode "mathiasfrohlich.Kotlin"
vscode "mikestead.dotenv"
vscode "mquandalle.graphql"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.python"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.sublime-keybindings"
vscode "pancho111203.vscode-ipython"
vscode "redhat.vscode-yaml"
vscode "robert-brunhage.flutter-riverpod-snippets"
vscode "rust-lang.rust-analyzer"
vscode "ryanolsonx.solarized"
vscode "sainnhe.everforest"
vscode "sonianurag.paper-theme"
vscode "stkb.rewrap"
vscode "twxs.cmake"
vscode "undefined_publisher.hujson-grammar-and-syntax-highlighting"
vscode "visualdecree.honeywell-theme"
vscode "vscjava.vscode-gradle"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "waderyan.gitblame"
vscode "wmaurer.change-case"
vscode "yile-ou.paddy-color-theme"
vscode "yzhang.markdown-all-in-one"
vscode "ZamBam83.nord-theme"
vscode "zxh404.vscode-proto3"
